[
  {
    "plantId": 1,
    "plantName": "Alocasia Plant",
    "category": "Foliage",
    "price": 25,
    "rating": 4.7,
    "availableStock": 15,
    "careLevel": "Medium",
    "description": "Known for its stunning, large, arrow-shaped leaves, the Alocasia (or Elephant Ear) adds a dramatic, tropical flair to any indoor space. It thrives in bright, indirect light and high humidity. While beautiful, it requires consistent watering and attention, making it a rewarding challenge for plant lovers.",
    "image": "https://i.ibb.co/bjGjBmqV/Alocasia-Plant.webp",
    "providerName": "Tropical Vibes Nursery"
  },
  {
    "plantId": 2,
    "plantName": "Azalea Plant",
    "category": "Flowering Plant",
    "price": 30,
    "rating": 4.6,
    "availableStock": 12,
    "careLevel": "Medium",
    "description": "Azaleas are celebrated for their vibrant and abundant spring blooms, coming in shades of pink, red, white, and purple. These flowering shrubs prefer acidic soil and a partially shaded location. They are perfect for adding a burst of color to garden borders or as a beautiful indoor potted plant during their blooming season.",
    "image": "https://i.ibb.co/C3QZQgCb/Azalea-Plant.webp",
    "providerName": "Bloom & Petal Gardens"
  },
  {
    "plantId": 3,
    "plantName": "Indian Basil",
    "category": "Herbs",
    "price": 12,
    "rating": 4.9,
    "availableStock": 25,
    "careLevel": "Easy",
    "description": "Also known as Tulsi or Holy Basil, this aromatic herb is revered in India for its medicinal properties and spiritual significance. It's a key ingredient in many traditional remedies and teas. It is relatively easy to grow, requires ample sunlight, and regular watering. Its fresh, fragrant leaves can be used daily.",
    "image": "https://i.ibb.co/v4f22nbx/Indian-Basil.webp",
    "providerName": "Herbal Heritage"
  },
  {
    "plantId": 4,
    "plantName": "Rubber Plant",
    "category": "Air Purifier",
    "price": 22,
    "rating": 4.7,
    "availableStock": 18,
    "careLevel": "Easy",
    "description": "The Rubber Plant (Ficus elastica) is a popular houseplant known for its large, glossy, dark green leaves. It's an excellent air purifier and a robust, low-maintenance choice for beginners. It prefers bright, indirect light and allowing the soil to dry out between waterings. It can grow quite tall, making a strong statement.",
    "image": "https://i.ibb.co/C5D63n1T/Rubber-Plant.webp",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 5,
    "plantName": "Spark Plant",
    "category": "Terrarium Plant",
    "price": 16,
    "rating": 4.5,
    "availableStock": 20,
    "careLevel": "Medium",
    "description": "The 'Spark Plant' is a vibrant cultivar, likely a Fittonia, known for its striking, veined leaves that create a 'spark' of color. Its intricate patterns in pink, red, or white stand out against its green foliage. It loves high humidity and low to medium indirect light, making it a perfect choice for terrariums or bathrooms.",
    "image": "https://i.ibb.co/8nP43q3p/Spark-Plant.webp",
    "providerName": "Exotic Botanicals"
  },
  {
    "plantId": 6,
    "plantName": "Splender Plant",
    "category": "Foliage",
    "price": 28,
    "rating": 4.6,
    "availableStock": 11,
    "careLevel": "Medium",
    "description": "Known as the 'Splender Plant,' this Calathea variety showcases nature's artistry with its splendid, decorative leaves. The foliage often features intricate patterns and rich colors. As a 'prayer plant,' its leaves fold up at night. It requires high humidity and filtered, indirect light to maintain its splendid appearance.",
    "image": "https://i.ibb.co/0VQX2wXP/Splender-Plant.webp",
    "providerName": "Green Leaf Exotics"
  },
  {
    "plantId": 7,
    "plantName": "Sprout Plant",
    "category": "Beginner",
    "price": 15,
    "rating": 4.8,
    "availableStock": 30,
    "careLevel": "Easy",
    "description": "Often called the Chinese Money Plant, the 'Sprout Plant' (Pilea) is famous for its round, coin-shaped leaves and its tendency to produce many 'pups' or 'sprouts.' It's a fast-growing and easy-to-propagate plant, symbolizing good fortune. It thrives in bright, indirect light and is a favorite among beginners.",
    "image": "https://i.ibb.co/LDy5ZZ0W/Sprout-Plant.webp",
    "providerName": "Friendly Flora"
  },
  {
    "plantId": 8,
    "plantName": "Weeping Fig",
    "category": "Indoor Tree",
    "price": 45,
    "rating": 4.4,
    "availableStock": 8,
    "careLevel": "Medium",
    "description": "The Weeping Fig (Ficus benjamina) is a graceful, elegant indoor tree with a slender trunk and a dense canopy of glossy, pointed leaves. It's effective at filtering indoor air pollutants. This plant can be sensitive to changes in its environment, preferring stable, bright, indirect light and consistent watering.",
    "image": "https://i.ibb.co/cSkHcYHn/Weeping-Fig.webp",
    "providerName": "UrbanGreen Studio"
  }
]
